HYD-ML-00064439:terraform-provider-bigip papineni$ cat test.tf 
provider "bigip" {
  address  = "xxxxx"
  username = "xxxx"
  password = "xxxx"
}

resource "bigip_ltm_monitor" "test_monitor" {
  name       = "/Common/terra_monitor"
  parent     = "/Common/postgresql"
  username   = "sql_tester"
  password   = "abcd"
  database   = "postgre"

  lifecycle {
    ignore_changes = [
   	password
     ]
  }

}

HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply
2020/06/03 13:24:13 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_monitor.test_monitor will be created
  + resource "bigip_ltm_monitor" "test_monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + database       = "postgre"
      + destination    = (known after apply)
      + id             = (known after apply)
      + interval       = (known after apply)
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/terra_monitor"
      + parent         = "/Common/postgresql"
      + password       = (sensitive value)
      + reverse        = (known after apply)
      + time_until_up  = (known after apply)
      + timeout        = (known after apply)
      + transparent    = (known after apply)
      + username       = "sql_tester"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_monitor.test_monitor: Creating...
bigip_ltm_monitor.test_monitor: Creation complete after 8s [id=/Common/terra_monitor]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 

HYD-ML-00064439:terraform-provider-bigip papineni$ cat terraform.tfstate
{
  "version": 4,
  "terraform_version": "0.12.18",
  "serial": 27,
  "lineage": "fde32681-c7b4-2220-0316-acd82be01754",
  "outputs": {},
  "resources": [
    {
      "mode": "managed",
      "type": "bigip_ltm_monitor",
      "name": "test_monitor",
      "provider": "provider.bigip",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "adaptive": "",
            "adaptive_limit": 0,
            "compatibility": "",
            "database": "postgre",
            "defaults_from": "",
            "destination": "*:*",
            "filename": "",
            "id": "/Common/terra_monitor",
            "interval": 30,
            "ip_dscp": 0,
            "manual_resume": "disabled",
            "mode": "",
            "name": "/Common/terra_monitor",
            "parent": "/Common/postgresql",
            "password": "$M$wu$EPm+EA0yWLnPslmz5ZEOkw==",
            "receive": "",
            "receive_disable": "",
            "reverse": "",
            "send": "",
            "time_until_up": 0,
            "timeout": 91,
            "transparent": "",
            "username": "sql_tester"

HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply
2020/06/03 13:26:20 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
bigip_ltm_monitor.test_monitor: Refreshing state... [id=/Common/terra_monitor]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 
